{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs for high-quality heart, flower, and balloon image assets to their respective component files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing their roles in the romantic birthday app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Romantic Birthday Website that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React component managing an 8-stage app state machine with timed auto-transitions, stage-aware animation counts for hearts, flowers, and balloons, and rendering of all three animation overlay components.",
  "frontend/src/components/BalloonAnimation.tsx": "Renders up to 35 rising balloon images in a fixed full-viewport overlay at z-index 3, using a PNG asset with randomized position, size, speed, drift, and tilt per balloon.",
  "frontend/src/components/FloatingHearts.tsx": "Renders up to 40 floating heart images in a fixed full-viewport overlay at z-index 1, using a PNG asset with randomized position, size, opacity, drift, and rotation per heart.",
  "frontend/src/components/FlowerRain.tsx": "Renders up to 40 falling flower images in a fixed full-viewport overlay at z-index 2, using a PNG asset with randomized position, size, speed, drift, and rotation per flower.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor via React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend queries that exports nothing, indicating no backend queries are needed for this frontend-only application.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind base/components/utilities, and defines a romantic oklch-based color palette with custom component classes for buttons and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom romantic color palette (rose, cream, gold, magenta), typography fonts (Playfair, Dancing Script, Lato), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a premium romantic birthday website with a multi-step interactive flow (opening animation, Yes/No choice, blackout, light reveal, flower decoration, balloon launch, final message) and required image assets."
}