{
  "kind": "build_request",
  "title": "Replace heart, flower, and balloon visual assets with high-quality recognizable graphics",
  "projectName": "Romantic Birthday",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Generate and use a high-quality heart image asset that renders as a clearly recognizable, smooth, sharp heart shape. The graphic must have clean edges, proper heart proportions, and be visually premium — not distorted, abstract, or unclear. Use this asset in the FloatingHearts component to replace the current heart graphic. All animation properties (movement, speed, opacity, size variation, count, placement, z-index, layering, distribution) must remain exactly unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace the current floating hearts with new, high-quality heart graphics. The hearts must clearly look like proper heart shapes. They should be visually sharp, smooth, and easily recognizable. They must not look distorted, unclear, abstract, or like random shapes. Keep the same animation style, movement, placement, layering, and intensity as before."
        ]
      },
      "acceptanceCriteria": [
        "The heart graphic is clearly and immediately recognizable as a proper heart shape",
        "The graphic is sharp, smooth, and visually premium with no distortion or abstract appearance",
        "All FloatingHearts animation parameters (count, speed, opacity, size, placement, z-index, distribution) are identical to before",
        "No theme colors, background, or any other UI element is changed"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Generate and use a high-quality flower image asset that renders as a clearly recognizable flower with visible, properly shaped petals. The graphic should be aesthetically pleasing, realistic-looking, and premium. Use this asset in the FlowerRain component to replace the current flower graphic. All animation properties (falling behavior, timing, speed, count, intensity logic, placement, z-index) must remain exactly unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace the current falling flowers with clearer, more realistic flower graphics. The flowers must clearly look like flowers (petals visible and properly shaped). They should be aesthetically pleasing and premium-looking. Keep the same falling animation behavior. Maintain the same intensity logic (flowers dominant when decorate is clicked). Do not change animation timing or layout behavior."
        ]
      },
      "acceptanceCriteria": [
        "The flower graphic clearly shows a flower with visible, properly shaped petals",
        "The graphic is aesthetically pleasing, realistic, and premium-looking",
        "All FlowerRain animation parameters (count, timing, speed, placement, z-index, intensity logic per stage) are identical to before",
        "No theme colors, background, or any other UI element is changed"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Generate and use a high-quality balloon image asset that renders as a clearly recognizable balloon with proper balloon shape and a visible string at the bottom. The graphic should be visually attractive and easily identifiable as a balloon. Use this asset in the BalloonAnimation component to replace the current balloon graphic. All animation properties (upward flying movement, speed, count, intensity balance, placement, z-index, layering) must remain exactly unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace the current balloons with proper balloon graphics. Balloons must clearly look like balloons (with proper shape and string). They should be visually attractive and easily identifiable. Keep the same upward flying animation. Maintain the same intensity balance (balloons slightly more dominant when activated). Do not modify any animation flow or screen layering."
        ]
      },
      "acceptanceCriteria": [
        "The balloon graphic clearly shows a proper balloon shape with a visible string at the bottom",
        "The graphic is visually attractive and immediately identifiable as a balloon",
        "All BalloonAnimation parameters (count, speed, upward movement, placement, z-index, intensity balance per stage) are identical to before",
        "No theme colors, background, or any other UI element is changed"
      ]
    }
  ],
  "constraints": [
    "Do NOT change any text or wording anywhere in the app",
    "Do NOT change any button styling, colors, or hover effects",
    "Do NOT change the romantic pink theme or any theme colors",
    "Do NOT change any transition or animation timing",
    "Do NOT change the stage sequence or app state logic",
    "Do NOT change the layout structure or component hierarchy",
    "Do NOT change any animation movement style, speed, count, opacity, size variation, z-index, or distribution logic",
    "Do NOT change any code logic — only the visual asset files used by FloatingHearts, FlowerRain, and BalloonAnimation components"
  ],
  "nonGoals": [
    "Adding new animations or motion behaviors",
    "Changing the number of hearts, flowers, or balloons at any stage",
    "Modifying the app state machine or stage transitions",
    "Altering background colors or the romantic theme palette",
    "Changing typography or button styles",
    "Modifying backend logic"
  ],
  "imageRequirements": {
    "required": [
      "Smooth, sharp, high-quality deep rose-pink heart shape with clean edges, proper symmetrical proportions, soft gradient shading from rose to magenta, on a transparent background (heart-graphic.dim_120x120.png)",
      "Realistic premium flower with fully visible soft pink and blush-white petals arranged in a natural bloom pattern, golden yellow center, on a transparent background (flower-graphic.dim_120x120.png)",
      "Vibrant colorful balloon with a smooth oval balloon body in bright pink/red, subtle highlight sheen, and a thin curved string hanging from the bottom knot, on a transparent background (balloon-graphic.dim_80x140.png)"
    ],
    "edits": []
  }
}